 //Напишите программу, которая задаёт 
 //массив из 8 элементов и выводит их на экран.
 //1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19] 
 //6, 1, 33 -> [6, 1, 33]
  
int a, i;
 i = 0;
while ( i <= 7)
{
 i++;
 a = new Random().Next(1, 20);
 Console.Write($"{a}, ");
}
